<a href="https://colab.research.google.com/github/thisisharrison/preface-assessment/blob/main/Titanic_Practice.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
! git clone https://github.com/PrefaceCoding/M2L6

Cloning into 'M2L6'...
remote: Enumerating objects: 4, done.
remote: Counting objects: 100% (4/4), done.
remote: Compressing objects: 100% (4/4), done.
remote: Total 4 (delta 0), reused 4 (delta 0), pack-reused 0
Unpacking objects: 100% (4/4), done.

In [2]:
import pandas as pd 
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

In [ ]:
# pandas - package with data types desinged to make working with "relational" and "labeled" data easy
# a data analysis/manipulation tool 
# tabular data - think excel spreadsheet 
# ordered and unordered data 
# row and column data

In [ ]:
# matplotlib - plotting library
# creating static, animated and interactive visualization

In [ ]:
# seaborn - visualizaation library based on matplotlib
# draws informative statistical graphics

In [ ]:
# numpy - numerical computing tools for python

In [3]:
titanic = pd.read_csv("M2L6/titanic_train.csv")
titanic

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [ ]:
# Exploratory Data Analysis
# performing initial *investigation* on data
# summary of statistics and graphical representation
# objective: discover patterns, spot anomalies, test hypothesis, check assumption

In [11]:
# Returns the first n rows for the object based on position.
# It is useful for quickly testing if your object has the right type of data in it.
# For negative values of n, this function returns all rows except the last n rows, 
# equivalent to df[:-n].

titanic.head() # 5
titanic.head(2) # 2
titanic.tail() # 890
titanic.head(-2) # 888

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
884          885         0       3  ...   7.0500   NaN         S
885          886         0       3  ...  29.1250   NaN         Q
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S

[889 rows x 12 columns]

In [13]:
# Print a concise summary of a DataFrame.
# prints information about a DataFrame including the index dtype and column dtypes, 
# non-null values and memory usage.

# dtype
# non-null
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB